package by.epam.bokhan.entity;

/**
 * Created by vbokh on 24.07.2017.
 */
public enum Genre {
    АВТОБИОГРАФИЯ(31,"Автобиография"), БИЗНЕС(33,"Бизнес"), БИОГРАФИЯ(32,"Биография"), ДЕТЕКТИВ(36,"Детектив"), ДЕТСКАЯ_ЛИТЕРАТУРА(37,"Детская литература"), ДРАМА(29,"Драма"),
    ИНФОРМАЦИОННЫЕ_ТЕХНОЛОГИИ(38,"Информационные технологии"), ИСТОРИЯ(25,"История"), КОМЕДИЯ(27,"Комедия"), КОРОТКАЯ_ИСТОРИЯ(21,"Короткая история"), МИФ(30,"Миф"), ПОЭМА(39,"Поэма"),
    ПРИКЛЮЧЕНИЯ(34,"Приключения"), ПЬЕСА(24,"Пьеса"), РЕЛИГИЯ(40,"Религия"), РОМАН(1,"Роман"), СКАЗКА(22,"Сказка"), ТРАГЕДИЯ(28,"Трагедия"), ФАНТАСТИКА(35,"Фантастика"),
    ЭПОС(26,"Эпос"), ЭССЕ(23,"Эссе");

    private String name;
    private int id;
    Genre(int id, String name){
        this.id = id;
        this.name = name;
    }

    public String getName() {
        return name;
    }

    public int getId() {
        return id;
    }
}
